app/controllers/bearings_controller.rb

  def index
    @bearings = Bearing.all
---
SELECT "bearings".* FROM "bearings"

  def create
    @bearing = Bearing.new(bearing_params)
    @bearing.codeno = 'BRG' + @bearing.materialdescription + @bearing.typec


    respond_to do |format|
      if @bearing.save
---
INSERT INTO "bearings" ("codeno", "created_at", "materialdescription", "quantity", "size", "slno", "typec", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_bearing
      @bearing = Bearing.find(params[:id])
---
SELECT "bearings".* FROM "bearings" WHERE "bearings"."id" = ? LIMIT 1  [["id", "logo"]]