app/controllers/fasteners_controller.rb

SELECT "fasteners".* FROM "fasteners"
---
  def index
    @fasteners = Fastener.all