app/controllers/fittings_controller.rb

SELECT "fittings".* FROM "fittings"
---
  def index
    @fittings = Fitting.all