app/controllers/gaskets_controller.rb

  def index
    @gaskets = Gasket.all
---
SELECT "gaskets".* FROM "gaskets"

    def set_gasket
      @gasket = Gasket.find(params[:id])
---
SELECT "gaskets".* FROM "gaskets" WHERE "gaskets"."id" = ? LIMIT 1  [["id", "index"]]