app/controllers/individuals_controller.rb

SELECT "individuals".* FROM "individuals"
---
  def index
    @individuals = Individual.all

INSERT INTO "individuals" ("closesin", "created_at", "description", "price", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @individual = Individual.new(individual_params)
    @individual.uid = SecureRandom.hex(4);
    @individual.save

SELECT "individuals".* FROM "individuals" WHERE "individuals"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_individual
      @individual = Individual.find(params[:id])