app/controllers/pipes_controller.rb

SELECT "pipes".* FROM "pipes"
---
  def index
    @pipes = Pipe.all