app/controllers/rods_controller.rb

SELECT "rods".* FROM "rods"
---
  def index
    @rods = Rod.all

INSERT INTO "rods" ("code", "created_at", "dia", "lg", "material", "price", "quantity", "size", "slno", "tk", "typec", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rod = Rod.new(rod_params)
    @rod.slno = @rod.id
    @rod.code = 'ROD' + @rod.material + @rod.typec

    respond_to do |format|
      if @rod.save

SELECT "rods".* FROM "rods" WHERE "rods"."id" = ? LIMIT 1  [["id", "7"]]
---
    def set_rod
      @rod = Rod.find(params[:id])