app/controllers/tubes_controller.rb

SELECT "tubes".* FROM "tubes"
---
  def index
    @tubes = Tube.all

INSERT INTO "tubes" ("codeno", "created_at", "lg", "materialgrade", "od", "price", "quantity", "slno", "typec", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tube = Tube.new(tube_params)
    @tube.codeno= 'TUB' + @tube.materialgrade + @tube.typec


    respond_to do |format|
      if @tube.save

SELECT "tubes".* FROM "tubes" WHERE "tubes"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_tube
      @tube = Tube.find(params[:id])