app/controllers/weldings_controller.rb

SELECT "weldings".* FROM "weldings"
---
  def index
    @weldings = Welding.all